app/controllers/students_controller.rb

  def create
    # binding.pry
    @student = Student.create(params[:student])
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-09-23 03:35:30.517420"], ["updated_at", "2018-09-23 03:35:30.517420"]]

  def update
    @student.update(params[:student])
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Little Rick"], ["last_name", "Sanches"], ["updated_at", "2018-09-24 21:21:07.102108"], ["id", 3]]

  def set_default
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]